In [30]:
import pandas as pd

In [31]:
dt =  pd.read_csv("train.csv")

In [32]:
dt.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [33]:
dt = dt.drop("Cabin",axis=1)

In [34]:
dt.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [35]:
dt["Pclass"].isnull().sum()

0

In [36]:
dt["Sex"].isnull().sum()

0

In [37]:
dt["Age"].isnull().sum()

177

In [38]:
dt["Age"].mean()

29.69911764705882

In [39]:
dt["Age"].fillna(30.0,inplace=True)

In [40]:
dt["Age"].isnull().sum()

0

In [41]:
dt["Fare"].isnull().sum()

0

In [42]:
dt["Sex"].replace(["female","male"],[0,1],inplace=True)

In [43]:
dt.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,S

In [44]:
dt.set_index("PassengerId",inplace=True)

In [45]:
dt.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
PassengerId,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C
3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,S
5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,S

In [46]:
dt["Pclass"].isnull().sum()

0

In [47]:
features = ["Pclass","Sex","Age","Fare"]
Target = ["Survived"]

In [48]:
X = dt[features]
y = dt[Target]

In [49]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(
    X, y, test_size=0.33, random_state=42)

In [117]:
from sklearn.ensemble import RandomForestClassifier
neigh = RandomForestClassifier(n_estimators=70, max_features='sqrt')

In [118]:
neigh.fit(X_train,y_train)

C:\Users\saurav007\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  """Entry point for launching an IPython kernel.

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='sqrt', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=70, n_jobs=1,
            oob_score=False, random_state=None, verbose=0,
            warm_start=False)

In [119]:
ypre = neigh.predict(X_test)

In [120]:
neigh.score(X_test,y_test)

0.81016949152542372

In [121]:
dtest = pd.read_csv("test.csv")

In [122]:
dtest.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [123]:
dtest["Pclass"].isnull().sum()

0

In [124]:
dtest["Sex"].isnull().sum()

0

In [125]:
dtest["Sex"].replace(["female","male"],[0,1],inplace=True)

In [126]:
dtest["Age"].isnull().sum()

86

In [127]:
dtest["Age"].fillna(dtest["Age"].median(),inplace=True)

In [128]:
dtest["Fare"].isnull().sum()

1

In [129]:
dtest["Fare"].fillna(dtest["Fare"].median(),inplace=True)

In [130]:
Xtest = dtest[features]

In [131]:
j=neigh.predict(Xtest)

In [132]:
pd.DataFrame({"PassengerId":dtest["PassengerId"],"Survived":j}).set_index("PassengerId").to_csv("Kaggle.csv")